Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5500405038442587788" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180671036000" -> "1758350743479668000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7982364795509761812" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1737448472789048000" -> "1758350742138831000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1763419363725647721" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292517221816000" -> "1758350743760234200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "744614199742123799" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739950386465660000" -> "1758350742125910000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1188359493279555700" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180250890000" -> "1758350741863298800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6013374098159483907" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748396983081240800" -> "1758350743453025200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4250535974323216930" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742181576398202000" -> "1758350740674074800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "992040923457377070" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742181577061003000" -> "1758350742074343000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:b9d2c37590fe3c48ceb5e5b452386255e2a1c51b3da3d7aaa0ed3cfc7db3a33b" -> (known after apply)
      ~ last_modified                  = "2025-09-17T08:44:44.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1306489688188612194" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080898092570000" -> "1758350741460867000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66" -> (known after apply)
      ~ code_sha256                 = "igTE57sYZ1CsFjeJ7gaBPKBk25tTq+9e7gvXzF81GxA=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-17T05:52:20.437+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> "builds/38e7ef889657d2f2693aad4a6af5e62414e077a854fa8ae024d3782586865f04.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398778 -> (known after apply)
      ~ version                     = "66" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "5472c1364d0203dcd712fa65adaff731-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers-20250725041417117200000004/builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> (known after apply)
      ~ key                           = "builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> "builds/38e7ef889657d2f2693aad4a6af5e62414e077a854fa8ae024d3782586865f04.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> "builds/38e7ef889657d2f2693aad4a6af5e62414e077a854fa8ae024d3782586865f04.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/38e7ef889657d2f2693aad4a6af5e62414e077a854fa8ae024d3782586865f04.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/38e7ef889657d2f2693aad4a6af5e62414e077a854fa8ae024d3782586865f04.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9013671634351355598" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> "builds/38e7ef889657d2f2693aad4a6af5e62414e077a854fa8ae024d3782586865f04.zip"
          ~ "timestamp" = "1758088183721438000" -> "1758350757980712000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34" -> (known after apply)
      ~ code_sha256                 = "qe0BD1dsTOS5RWWGusw9C1jZzODJMyIGmm+rvoXYONM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-17T08:44:12.161+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/b439169fb3b1a51fad2f762ab309ab007d6b369f45f28b758dd0fcd791078a73.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 39435 -> (known after apply)
      ~ version                     = "34" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "a0ba0189bff09b03d7e41589571d0459" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers-20250725041417117200000004/builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ key                           = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/b439169fb3b1a51fad2f762ab309ab007d6b369f45f28b758dd0fcd791078a73.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/b439169fb3b1a51fad2f762ab309ab007d6b369f45f28b758dd0fcd791078a73.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b439169fb3b1a51fad2f762ab309ab007d6b369f45f28b758dd0fcd791078a73.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b439169fb3b1a51fad2f762ab309ab007d6b369f45f28b758dd0fcd791078a73.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7618067917688549593" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/b439169fb3b1a51fad2f762ab309ab007d6b369f45f28b758dd0fcd791078a73.zip"
          ~ "timestamp" = "1758080898094948000" -> "1758350741721894000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "security-sendSecurityAlert"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "security-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GASPI_ADMIN_EMAIL" = "devops@xapiens.id" -> "brendan.hosking@csiro.au"
              ~ "SES_SOURCE_EMAIL"  = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4488229160437384110" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1746500163130550000" -> "1758350741558779000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "45f32ed728d37f95caff9c01b8efbc53506894ba"
        }

      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:86abe8d3e61240088a42193b4841df16585f06fe2d9528edee94a1e748d9274d" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:86abe8d3e61240088a42193b4841df16585f06fe2d9528edee94a1e748d9274d" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "dac6b4856aceea26819187a71c2039dd175e2bbe" -> "45f32ed728d37f95caff9c01b8efbc53506894ba"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "6c7dc1f9f87f467880d6cd29fd7ceb768df654db"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:bb6b51e5a9db89e0faa6e0f312c31895dcd99ab4370569ddc8fbdab97bf29675" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:bb6b51e5a9db89e0faa6e0f312c31895dcd99ab4370569ddc8fbdab97bf29675" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "6c4d96f803c217845ee91c144ffa73c17bd512ee" -> "6c7dc1f9f87f467880d6cd29fd7ceb768df654db"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7794161285814032736" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753928922753800000" -> "1758350743138079000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2352576012106905925" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753928923061675000" -> "1758350742520937000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3415458276826653134" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908990909000" -> "1758350742483899200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concat"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1229429640374266393" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909079166800" -> "1758350741855633000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5640641743544315098" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909271470000" -> "1758350742723275800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3832487766868513479" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908869195000" -> "1758350742548894000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2501910734799886106" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909002063000" -> "1758350741764509000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-deleteClinicalWorkflow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7829874712274340194" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908447426000" -> "1758350742619949200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/bad3415550ced4a6beaf9659c18f8ea3225f37792fd8d8e61e5e833d4706a45a.zip" -> "builds/7bbbf9a7c1db66d628c071c39a4e947d311a8dc6f031c15b7d1152592b9ae039.zip"
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-09-17T08:44:23.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/formatOutput",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7bbbf9a7c1db66d628c071c39a4e947d311a8dc6f031c15b7d1152592b9ae039.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7bbbf9a7c1db66d628c071c39a4e947d311a8dc6f031c15b7d1152592b9ae039.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9210541488426960555" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bad3415550ced4a6beaf9659c18f8ea3225f37792fd8d8e61e5e833d4706a45a.zip" -> "builds/7bbbf9a7c1db66d628c071c39a4e947d311a8dc6f031c15b7d1152592b9ae039.zip"
          ~ "timestamp" = "1758080909272576000" -> "1758350742854332000"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTERS"                    = jsonencode(
                  ~ {
                      ~ min_qual         = 10 -> 0
                        # (4 unchanged attributes hidden)
                    }
                )
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1617846824005225479" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908460342000" -> "1758350741968677000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "289471293045235662" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909059266000" -> "1758350743551668800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4825164125081045346" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908663704000" -> "1758350743172394000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:86abe8d3e61240088a42193b4841df16585f06fe2d9528edee94a1e748d9274d" -> (known after apply)
      ~ last_modified                  = "2025-09-17T05:18:34.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3351068757711646136" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908539043000" -> "1758350742359766000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadConstraint"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "33941513279991897" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909382594200" -> "1758350741936357000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1bbca2f0065dc117132bea72e9ecf2b8f7f5ccf0e44856b171832a7edca01727.zip" -> "builds/9073411073bc1b61a5c556e2964b8c0f419d8ae4a5377d761252520624c62170.zip"
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-09-17T08:44:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/9073411073bc1b61a5c556e2964b8c0f419d8ae4a5377d761252520624c62170.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9073411073bc1b61a5c556e2964b8c0f419d8ae4a5377d761252520624c62170.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6490089679236064760" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1bbca2f0065dc117132bea72e9ecf2b8f7f5ccf0e44856b171832a7edca01727.zip" -> "builds/9073411073bc1b61a5c556e2964b8c0f419d8ae4a5377d761252520624c62170.zip"
          ~ "timestamp" = "1758080909459730000" -> "1758350743043149000"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:bb6b51e5a9db89e0faa6e0f312c31895dcd99ab4370569ddc8fbdab97bf29675" -> (known after apply)
      ~ last_modified                  = "2025-09-17T07:22:27.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8622304152912603379" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1752130792776662200" -> "1758350740520009000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4045000721969498571" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909219813200" -> "1758350740933221200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTER_MIN_QUAL"                 = "10" -> "0"
                # (9 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1776376401560736370" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908546866000" -> "1758350741422182000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8582318408068066684" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909194432000" -> "1758350742882497000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8214084782844469749" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908939124200" -> "1758350742042560200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8749383895201878712" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909467249000" -> "1758350741336453000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61" -> (known after apply)
      ~ code_sha256                 = "an8kQxYQZVkfN3KSvxBbhZ4eIQcakGzfLwUUFrhoYfg=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-17T08:44:12.417+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/1b5f6a9d6101258e418605aa3ad817bf3ed260046ae44d752e0c35449ffd2203.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 13260 -> (known after apply)
      ~ version                     = "61" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250814060124462100000005/builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "b3b739abb4d2683b482298b67afc64e2" -> (known after apply)
      ~ id                            = "svep-backend-layers-20250814060124462100000005/builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> (known after apply)
      ~ key                           = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/1b5f6a9d6101258e418605aa3ad817bf3ed260046ae44d752e0c35449ffd2203.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/1b5f6a9d6101258e418605aa3ad817bf3ed260046ae44d752e0c35449ffd2203.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1b5f6a9d6101258e418605aa3ad817bf3ed260046ae44d752e0c35449ffd2203.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1b5f6a9d6101258e418605aa3ad817bf3ed260046ae44d752e0c35449ffd2203.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7465762276928745353" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/1b5f6a9d6101258e418605aa3ad817bf3ed260046ae44d752e0c35449ffd2203.zip"
          ~ "timestamp" = "1758080909369395000" -> "1758350743034067000"
        }
    }

Plan: 80 to add, 57 to change, 68 to destroy.

Changes to Outputs:
  ~ admin_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=admin1234 --output json --query AuthenticationResult.IdToken" -> "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=Admin1234! --output json --query AuthenticationResult.IdToken"
  ~ guest_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=guest1234 --output json --query AuthenticationResult.IdToken" -> "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=Guest1234! --output json --query AuthenticationResult.IdToken"
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "svep-warning-thresholds"
│ but a value was found in file "hub01.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: hub01-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "hub01-plan.out"
✅ Terraform plan created successfully: hub01-plan.out
ℹ️  Plan summary:

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:af807c6bf4a4b7450e3df8560d62148987b7e4e10164db5ace44cf3db597cedc307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:af807c6bf4a4b7450e3df8560d62148987b7e4e10164db5ace44cf3db597cedc" -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:186d66a9bc4afc4bb39a68887ad27961877dc553b8bf53f0702648d64a62e493307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:186d66a9bc4afc4bb39a68887ad27961877dc553b8bf53f0702648d64a62e493" -> null
ℹ️  Cleaning up sensitive files and configurations
ℹ️  Removing temporary files: *.out
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for hub01!

Thank you for using Atlantis Schema Deploy
© September, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  ============================================================
ℹ️  SCRIPT EXECUTION SUMMARY
ℹ️  ============================================================
ℹ️  Environment: hub01
ℹ️  Operation: plan
ℹ️  Exit Code: 0
ℹ️  Duration: 1594s
ℹ️  Timestamp: 2025-09-20T06:48:53Z
✅ Deployment completed successfully! 🎉
ℹ️  Cleaning up sensitive files and configurations
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-hub01
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-hub01
  ```

**Note: Objects have changed outside of Terraform**
Plan: 80 to add, 57 to change, 68 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```